--- a/docs/graphical-model.md
+++ b/docs/graphical-model.md
@@ -8,28 +10,35 @@ In a probabilistic graphical model, each node represents a random variable (or g
-    ### Bayesian network
+    <h4>Bayesian network</h4>
 
-    ``` mermaid
-    graph LR
-    Cloudy((Cloudy))
-    Sprinkler((Sprinkler))
-    Rain((Rain))
-    WetGrass((Wet grass))
+    ```graphviz
+    digraph G {
+      rankdir=LR;
 
-    Cloudy --> Sprinkler
-    Cloudy --> Rain
-    Sprinkler --> WetGrass
-    Rain --> WetGrass
+      node [shape=circle, style=filled, fillcolor=white];
+
+      Cloudy -> Sprinkler;
+      Cloudy -> Rain;
+      Sprinkler -> WetGrass;
+      Rain -> WetGrass;
+    }
     ```
 
     This represents the factorization
